Kyle Timmermans (R02) - Dr. Li - HW #2 - 3/4/21

Import statements to begin with, below

In [213]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [214]:
df_test = pd.read_csv('http://storm.cis.fordham.edu/~yli/data/testDataOne.csv') # Load a .csv file into a DataFrame object

**Problem 1:** Show the first five rows of the DataFrame table.

In [215]:
df_test.head(5)  # Show first 5 rows, head command similar to linux 'head' command

  firstName LastName         DOB    Major  tuition Paid
0      Lisa      AAA    1/1/2000       CS   5000.0  yes
1       Tom      BBB    1/1/1999     Math  12000.0   no
2      John      CCC  10/20/1989  Physics  15000.0   no
3      Matt      DDD   4/21/1989       CS  20667.0  yes
4      Kate      EEE  10/22/1989     Math  25667.0   no

**Problem 2:** Show number of rows and columns of this table.

In [216]:
print("Number of rows in this table is " + str(df_test.shape[0])) # shape returns two values
print("Number of columns in this table is " + str(df_test.shape[1]))

Number of rows in this table is 32
Number of columns in this table is 6

**Problem 3:** Show all column names.

In [217]:
print(df_test.columns.values)

['firstName' 'LastName' 'DOB' 'Major' 'tuition' 'Paid']

**Problem 4:** Set the name of the index of the table as 'FIDN', which starts from 1.

In [218]:
df_test.index.name = 'FIDN'  # Name of index of df_test
df_test.index +=1    # Start table index at 1
df_test.index.name  # Just print it as well to show it worked

'FIDN'

**Problem 5:** Find all students who majored in CS, how many of them are there?

In [219]:
df_test[df_test.Major=="CS"].shape[0]   # Use shape function to get number of rows which is a student each

11

**Problem 6:** Find all the students who have not paid tuition, how many of them? (Results should include unknown)

In [220]:
print(df_test[df_test.Paid!="yes"].shape[0])    # Anything that does not equal yes is 'NaN' or 'no'

21

**Problem 7:** Find all students who are CS and have not paid tuition. (The intersection of two index objects could be found by & operation)

In [222]:
# & operator works like var1.index & var2.index (Intersection)
csAndUnpaid = (df_test[df_test.Major=="CS"].index & df_test[df_test.Paid!="yes"].index).values    # Just FIDNs, we want names too
def getLocation(location):    # Index to name
  return str("Name: " + df_test.loc[location].firstName + " " + df_test.loc[location].LastName + " - FIDN: " + str(location))  # First and last name as one string
changed = map(getLocation, csAndUnpaid)   # Map val to func
print("\n".join(list(changed)))    # Print names and FIDNs as list with newlines for each student

Name: z CFEA - FIDN: 18
Name: z RTDH - FIDN: 21
Name: w RTR - FIDN: 24
Name: Tom VBV - FIDN: 27
Name: i FFF - FIDN: 30

**Problem 8:** Find students with FIDN 10 to 20.

In [223]:
df_test[9:20]  # Destination-1 to get just destination because index reset to 1 ("From 9 (not included) to 20")

     firstName LastName         DOB    Major   tuition Paid
FIDN
10           d      EEE  10/27/1989       CS   50667.0  yes
11           y      FFF  10/28/1989     Math   55667.0   no
12           y      HHH  10/29/1989  Physics   60667.0   no
13           c      GGG  10/30/1989       CS   65667.0  yes
14           y      JJK  10/31/1989     Math   70667.0   no
15           y     DFDF   11/1/1989  Physics   75667.0   no
16           y      DRE   11/2/1989       CS   80667.0  yes
17           z       CF   11/3/1989     Math   85667.0  yes
18           z     CFEA   12/4/1989       CS   90667.0   no
19          zz      YRY    1/5/1989     Math   95667.0   no
20           z   JGKJHK   11/6/1989  Physics  100667.0  yes

**Problem 9:** Find the major of the student whose FIDN is 30.

In [224]:
print(df_test.loc[30].Major)    # Use .loc to use exact index

CS

**Problem 10:** Sort all students by their last name, then by their tuition amount.

In [225]:
# Sorts through LastName and then tuition amount, if same name, uses tuition to decide which comes first
df_test.sort_values(by=['LastName', 'tuition'])

     firstName LastName         DOB    Major   tuition Paid
FIDN
1         Lisa      AAA    1/1/2000       CS    5000.0  yes
6         Bill      AAA  10/23/1989  Physics   30667.0   no
2          Tom      BBB    1/1/1999     Math   12000.0   no
7            A      BBB  10/24/1989       CS   35667.0  yes
3         John      CCC  10/20/1989  Physics   15000.0   no
8           B       CCC   1/25/1989     Math   40667.0   no
17           z       CF   11/3/1989     Math   85667.0  yes
18           z     CFEA   12/4/1989       CS   90667.0   no
4         Matt      DDD   4/21/1989       CS   20667.0  yes
9            c      DDD   3/26/1989  Physics   45667.0   no
15           y     DFDF   11/1/1989  Physics   75667.0   no
32          iy      DGK  11/18/1989  Physics  160667.0  yes
16           y      DRE   11/2/1989       CS   80667.0  yes
5         Kate      EEE  10/22/1989     Math   25667.0   no
10           d      EEE  10/27/1989       CS   50667.0  yes
11           y      FFF  10/28/1989     Math   55667.0   no
30           i      FFF  11/16/1989       CS  150667.0  NaN
28           y    FGSER   11/2/1989     Math  140667.0  NaN
26           r    FGSFH  11/21/1989  Physics  130667.0  yes
22          zz     FHSF   11/8/1990     Math  110667.0   no
13           c      GGG  10/30/1989       CS   65667.0  yes
23          zq    GHGJD   11/9/1989  Physics  115667.0  yes
12           y      HHH  10/29/1989  Physics   60667.0   no
20           z   JGKJHK   11/6/1989  Physics  100667.0  yes
14           y      JJK  10/31/1989     Math   70667.0   no
29           u      OPK  11/15/1989  Physics  145667.0  NaN
21           z     RTDH   10/7/1989       CS  105667.0   no
24           w      RTR  11/10/1989       CS  120667.0   no
25           e      VBV   1/11/1989     Math  125667.0   no
27         Tom      VBV  11/13/1989       CS  135667.0  NaN
31           d      WWA   1/17/1989     Math  155667.0   no
19          zz      YRY    1/5/1989     Math   95667.0   no